<script setup lang="ts">
import CustomAccordion from '~/components/common/Form/CustomAccordion.vue'

const items = [
  { label: 'Советы по заполнению данных', content: 'Правильное заполнение данных о вашем возрасте, весе и дате рождения — ключ к точному расчету риска диабета. Эти параметры влияют на оценку состояния вашего организма, и важно вводить их корректно.' },
  { label: 'Общие рекомендации', content: '<ul><li><b>Точность данных.</b> Указывайте информацию о возрасте и весе максимально точно — это важно для правильного расчета.</li><li><b>Не торопитесь.</b> Убедитесь, что все поля заполнены верно перед переходом к следующему шагу.</li><li><b>Конфиденциальность.</b> Ваши данные будут использоваться исключительно для диагностики и расчетов, их безопасность гарантирована.</li></ul>' },
]
</script>

<template>
  <CustomAccordion :items="items" />
</template>

<style lang="scss" scoped>
</style>
