<script lang="ts" setup>
import Typography from '~/components/common/Typography.vue'
</script>

<template>
  <div class="rules largeContainer">
    <div class="rules__rule">
      <Typography variant="h3">
        1. Сбор данных
      </Typography>
      <Typography variant="span">
        Мы собираем различные типы данных для предоставления функционала приложения и улучшения качества нашего сервиса: <br> <br>
        Персональная информация: Имя, фамилия, возраст, контактные данные.<br> <br>
        Медицинская информация: Данные, связанные с состоянием вашего здоровья, такие как результаты анализов, показатели вашего здоровья.<br> <br>
        Данные об устройстве: Информация о вашем устройстве, включая тип устройства, операционную систему, версию приложения, а также информацию о времени и длительности использования приложения.<br> <br>
      </Typography>
    </div>

    <div class="rules__rule">
      <Typography variant="h3">
        2. Использование данных
      </Typography>
      <Typography variant="span">
        Ваши данные используются для следующих целей:<br> <br>
        Предоставление услуг: Для оценки рисков диабета, мониторинга показателей здоровья персонализированных рекомендаций.<br> <br>
        Обработка и анализ: Для улучшения точности диагностики и рекомендаций, а также для научных исследований, если вы согласитесь на участие.<br> <br>
      </Typography>
    </div>

    <div class="rules__rule">
      <Typography variant="h3">
        3. Обработка медицинских данных
      </Typography>
      <Typography variant="span">
        Мы осознаем, что медицинские данные являются особо чувствительными. Все данные, касающиеся вашего здоровья, обрабатываются в строгом соответствии с законодательством о защите персональных данных и только в пределах целей диагностики диабета.<br> <br>
        Мы не передаем ваши медицинские данные третьим лицам без вашего согласия, если это не требуется по закону или в случае угрозы безопасности.<br> <br>
        В случае использования данных для исследований, все данные анонимизируются, и информация не будет использоваться для идентификации конкретных пользователей.<br> <br>
      </Typography>
    </div>

    <div class="rules__rule">
      <Typography variant="h3">
        4. Хранение данных
      </Typography>
      <Typography variant="span">
        Ваши данные хранятся в защищенных базах данных и используются только для тех целей, которые указаны в данной политике.
      </Typography>
    </div>

    <div class="rules__rule">
      <Typography variant="h3">
        5. Безопасность данных
      </Typography>
      <Typography variant="span">
        Мы принимаем все необходимые меры для защиты ваших данных от несанкционированного доступа, раскрытия, изменения или уничтожения. Это включает использование шифрования, защищенных каналов связи, а также регулярные проверки на наличие уязвимостей в приложении.
      </Typography>
    </div>

    <div class="rules__rule">
      <Typography variant="h3">
        6. Использование cookies и технологий отслеживания
      </Typography>
      <Typography variant="span">
        Мы используем cookies и другие технологии отслеживания для улучшения работы приложения и персонализации вашего опыта.
      </Typography>
    </div>

    <div class="rules__rule">
      <Typography variant="h3">
        7. Согласие на обработку данных
      </Typography>
      <Typography variant="span">
        При использовании нашего приложения вы даете согласие на обработку ваших данных в соответствии с настоящей политикой конфиденциальности. Если вы не согласны с нашей политикой, вы должны прекратить использование приложения.
      </Typography>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.rules {
  margin-top: 150px;
  display: flex;
  flex-direction: column;
  gap: 15px;

  &__rule {
    display: flex;
    flex-direction: column;
    gap: 10px;

    span {
      max-width: 900px;
    }
  }
}
</style>
